integrationWithDRL/rotatingCylinder2D/Allrun
#!/bin/bash
cd "${0%/*}" || exit
. "${DRL_BASE:?}"/openfoam/RunFunctions
#------------------------------------------------------------------------------

# run case
python main.py reference.yaml

#------------------------------------------------------------------------------
